<h1> Analyzing the listing and pricing trends in Kentucky metropolitan areas

<h2>Loading and viewing the data

In [1]:
import pandas as pd
import matplotlib
import numpy as np

In [7]:
count = pd.read_csv('NEWLISCOUKY.csv')
price = pd.read_csv('monthly.csv')

In [ ]:
count.head()

  observation_date  NEWLISCOUKY
0       2016-07-01         5792
1       2016-08-01         5474
2       2016-09-01         5216
3       2016-10-01         4888
4       2016-11-01         4168

In [ ]:
count[['observation_date', 'NEWLISCOUKY']]

    observation_date  NEWLISCOUKY
0         2016-07-01         5792
1         2016-08-01         5474
2         2016-09-01         5216
3         2016-10-01         4888
4         2016-11-01         4168
..               ...          ...
99        2024-10-01         4468
100       2024-11-01         4040
101       2024-12-01         3062
102       2025-01-01         3128
103       2025-02-01         3722

[104 rows x 2 columns]

In [8]:
price.head()

,observation_date,ACTLISCOU14540,ACTLISCOU23180,ACTLISCOU30460,ACTLISCOU31140,ACTLISCOU40080,AVELISPRI14540,AVELISPRI23180,AVELISPRI30460,AVELISPRI31140,...,PRIINCCOU14540,PRIINCCOU23180,PRIINCCOU30460,PRIINCCOU31140,PRIINCCOU40080,PRIREDCOU14540,PRIREDCOU23180,PRIREDCOU30460,PRIREDCOU31140,PRIREDCOU40080
0,2016-07-01,522,368,2037,4971,491,292729,200516,362255,280283,...,0,4,68,88,0,76,76,560,1468,92
1,2016-08-01,542,362,2093,4953,495,291261,199495,356649,279752,...,4,0,86,78,10,76,76,634,1536,128
2,2016-09-01,533,355,2102,4825,475,295251,200057,352670,279605,...,4,4,78,70,8,96,104,564,1460,128
3,2016-10-01,546,347,2082,4808,461,293936,199253,349462,276221,...,0,0,88,72,8,84,64,528,1460,112
4,2016-11-01,533,338,1940,4665,438,286367,201977,353036,274374,...,4,0,98,60,6,70,94,498,1308,86

In [9]:
price[['observation_date']]

    observation_date
0         2016-07-01
1         2016-08-01
2         2016-09-01
3         2016-10-01
4         2016-11-01
..               ...
99        2024-10-01
100       2024-11-01
101       2024-12-01
102       2025-01-01
103       2025-02-01

[104 rows x 1 columns]